read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog fa1bit.v rca4bit
synth -top adder_4bit
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr netlist_rca4bit.v
tee -o report_rca4bit.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib