read_liberty -lib sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog cla.v
synth -top CLA_Adder
#dfflibmap -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty sky130_fd_sc_hd__tt_025C_1v80.lib
clean
flatten
write_verilog -noattr netlist_cla4bit.v
tee -o report_cla4bit.txt stat -liberty sky130_fd_sc_hd__tt_025C_1v80.lib